CSI API ETABS v1

# cDCoItalianNTC2008CSetPreference Method

---

Sets the value of a concrete design preference item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetPreference(
    	int Item,
    	double Value
    )

    Function SetPreference (
    	Item As Integer,
    	Value As Double
    ) As Integer

    Dim instance As cDCoItalianNTC2008C
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.SetPreference(Item,
    	Value)

    int SetPreference(
    	int Item,
    	double Value
    )

    abstract SetPreference :
            Item : int *
            Value : float -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 3 and 34, inclusive, indicating the preference item
considered.

  3. Second order method
  4. Number of interaction curves
  5. Number of interaction points
  6. Consider minimum eccentricity
  7. Theta0
  8. Gamma steel
  9. Gamma concrete
  10. AlphaCC
  11. AlphaCT
  12. AlphaLCC
  13. AlphaLCT
  14. Pattern live load factor
  15. Utilization factor limit
  16. Multi-response case design
  17. Gamma concrete modulus

  18. Gamma concrete modulus
  19. Consider torsion
  20. Design for B/C capacity ratio
  21. Ignore Beneficial Pu for Beam Design?
  22. User defined allowable PT stresses
  23. Concrete Strength Ratio at Transfer fck(t) / fck
  24. Transfer: Top Fiber Tensile Stress / fctm(t)
  25. Transfer: Bottom Fiber Tensile Stress / fctm(t)
  26. Transfer: Extreme Fiber Compressive Stress / fck(t)
  27. Final: Top Fiber Tensile Stress / fctm
  28. Final: Bottom Fiber Tensile Stress / fctm
  29. Final: Extreme Fiber Compressive Stress / fck
  30. Sustained: Extreme Fiber Compressive Stress / fck
  31. Sustained: Fraction of Live Load Considered
  32. Longitudinal Rebar Size Top
  33. Longitudinal Rebar Size Bottom
  34. Is Longitudinal Rebar Ribbed

Value

    Type: SystemDouble
The value of the considered preference item.

  3. Second order method
     * 1 = Nominal stiffness
     * 2 = Nominal curvature
     * 3 = None
  4. Number of interaction curves

Value >= 4 and divisable by 4

  5. Number of interaction points

Value >= 5 and odd

  6. Consider minimum eccentricity

0 = No

Any other value = Yes

  7. Theta0

Value > 0

  8. Gamma steel

Value > 0

  9. Gamma concrete

Value > 0

  10. AlphaCC

Value > 0

  11. AlphaCT

Value > 0

  12. AlphaLCC

Value > 0

  13. AlphaLCT

Value > 0

  14. Pattern live load factor

Value >= 0

  15. Utilization factor limit

Value > 0

  16. Multi-response case design
     * 1 = Envelopes
     * 2 = Step-by step
     * 3 = Last step
     * 4 = Envelopes - All
     * 5 = Step-by step - All

  18. Gamma concrete modulus

Value > 0

  19. Consider torsion
     * 0 = No
     * Any other value = Yes
  20. Design for B/C capacity ratio
     * 0 = No
     * Any other value = Yes
  21. Ignore the benefit of Pu for beam design?
     * 0 = No
     * Any other value = Yes
  22. User defined allowable PT stresses
     * 0 = No
     * Any other value = Yes
  23. Concrete Strength Ratio at Transfer fck(t) / fck

Value > 0

  24. Transfer: Top Fiber Tensile Stress / fctm(t)

Value > 0

  25. Transfer: Bottom Fiber Tensile Stress / fctm(t)

Value > 0

  26. Transfer: Extreme Fiber Compressive Stress / fck(t)

Value > 0

  27. Final: Top Fiber Tensile Stress / fctm

Value > 0

  28. Final: Bottom Fiber Tensile Stress / fctm

Value > 0

  29. Final: Extreme Fiber Compressive Stress / fck

Value > 0

  30. Sustained: Extreme Fiber Compressive Stress / fck

Value > 0

  31. Sustained: Fraction of Live Load Considered

Value > 0

  32. Longitudinal Rebar Size Top

Value is the index in the list of the rebar defined in the Reinforcing Bar
Sizes form

  33. Longitudinal Rebar Size Bottom

Value is the index in the list of the rebar defined in the Reinforcing Bar
Sizes form

  34. Is Longitudinal Rebar Ribbed
     * 0 = No
     * Any other value = Yes

#### Return Value

Type: Int32
Returns zero if the item is successfully set; otherwise it returns a nonzero
value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'create new concrete frame section property
       ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)

    'set frame section property
       ret = SapModel.FrameObj.SetSection("8", "R1")

    'set concrete design code
       ret = SapModel.DesignConcrete.SetCode("Italian NTC 2008")

    'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis

    'start concrete design
       ret = SapModel.DesignConcrete.StartDesign()

    'set preference item
       ret = SapModel.DesignConcrete.ItalianNTC2008C.SetPreference(2, 7)

    'get preference item
       ret = SapModel.DesignConcrete.ItalianNTC2008C.GetPreference(2, Value)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDCoItalianNTC2008C Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com